package test.chap1.chap1_4;

public class Test1_4_1 {
    /**
     N >= 3
     N = 3   1   3*(3-1)*(3-2)/6
     N = 4   4   4*(4-1)*(4-2)/6
     N = 5   10  5*(5-1)*(5-2)/6
     N = 6   20  6*(6-1)*(6-2)/6
     */

    /**
    N = 3时，3*(3-1)*(3-2)/6=1，命题成立
     假设N=M时，命题成立。即N=M时，不同组合的数有M*(M-1)*(M-2)/6个
     当N=M+1时，数量为前M个数中三个数的总数和前M个书中两个数的总数(和最后一个组成三个数)之和
     M*(M-1)*(M-2)/6+M*(M-1)/2
     = M*(M-1)*(M-2)/6+3*M*(M-1)/6
     = M*(M-1)*(M-2+3)/6
     = (M+1)*M*(M-1)/6
     = (M+1)*((M+1)-1)*((M+1)-2)/6
     *
     */
}

